simulations/single_tree/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
libs (
    atmosphericModels
    myatmosphericModels
);

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         10000;

deltaT          1;

writeControl    timeStep;

writeInterval   5000;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

adjustTimeStep  no;

runTimeModifiable yes;

functions
{
    // residuals function object ==> monitor with 'foamMonitor -l' command
    residuals
    {
        type            solverInfo;
        libs            ("libutilityFunctionObjects.so");
        enabled         true;
        fields
        (
            k
            omega
            p
            U
        );
        log             true;
        executeControl  timeStep;
        executeInterval 1;
    }
}

// ************************************************************************* //
