simulations/single_tree/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    outlet
    {
        type            fixedValue;
        value           $internalField;
    }

    inlet
    {
        type            zeroGradient;
    }


    ground
    {
       
        type            zeroGradient;
    }

    top
    {
       
        type            zeroGradient;
    }

    lateral1
    {
        type            symmetryPlane;
    }

    lateral2
    {
        type            symmetryPlane;
    }
}


// ************************************************************************* //
