simulations/single_tree/0/k
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.1;

boundaryField
{
    inlet
    {
        type            atmBoundaryLayerInletK;
        #include        "include/ABLConditions"
    }

    outlet
    {
        type    zeroGradient;
    }

    ground
    {
        type    kqRWallFunction;
        value   uniform 0;
    }

    top
    {
        type    zeroGradient;
    }

    lateral1
    {
        type    symmetryPlane;
    }

    lateral2
    {
        type    symmetryPlane;
    }
}
