simulations/single_tree/0/omega
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 1.0;

boundaryField
{
    inlet
    {
        type            atmBoundaryLayerInletOmega;
        #include        "include/ABLConditions"
    }

    outlet
    {
        type    zeroGradient;
    }

    ground
    {
        type    omegaWallFunction;
        value   uniform 1.0;
    }

    top
    {
        type    zeroGradient;
    }

    lateral1
    {
        type    symmetryPlane;
    }

    lateral2
    {
        type    symmetryPlane;
    }
}
