simulations/single_tree/system/surfaceSubsetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceSubsetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

faces ( );
localPoints ( );
edges ();

// Select triangles (with face centre) inside box
zone
(
    (120 -620 40)
    (420 -320 80)
);


addFaceNeighbours yes;
invertSelection false;

// ************************************************************************* //
