simulations/single_tree/system/userDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

refinement
{
    r1
    {
        min_x   -173;
        max_x   -110;
        min_y   -28;
        max_y   -17;
        min_z   51.1;
        max_z   60;
    }

    r2
    {
        min_x   -0.9;
        max_x   0.9;
        min_y   -0.9;
        max_y   0.9;
        min_z   0.0;
        max_z   0.75;
    }

    r3
    {
        min_x   -0.2;
        max_x   0.2;
        min_y   -0.2;
        max_y   0.2;
        min_z   0.0;
        max_z   0.6;
    }
}


background
{
    // Length of cubic cells in "uniform" region [m]
    cells_scaling 1.5;

    // Domain limit
    min_x         -192.75;
    max_x         -62.3;
    min_y         -57.95;
    max_y         10.4;
    min_z         51.1;
    max_z         88.36;

    // Lengths
    length_x      #calc " ${max_x} - ${min_x} ";
    length_y      #calc " ${max_y} - ${min_y} ";
    length_z      #calc " ${max_z} - ${min_z} ";

    // Number of cells in each direction
    cells_x       #calc " int(${length_x} / ${cells_scaling}) ";
    cells_y       #calc " int(${length_y} / ${cells_scaling}) ";
    cells_z       #calc " int(${length_z} / ${cells_scaling}) ";
}
